---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIEventArgs
source: html/7c98499c-e345-cfda-ef89-48eccd3c9992.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventArgs

The class is used as base class for all event argument classes.

## Syntax (C#)
```csharp
public class RevitAPIEventArgs : EventArgs,
	IDisposable
```